#!/bin/python
# coding:utf-8
str1='''
{
    "id": "0002",
    "name": "归属地地域",
    "columnId": "belongRegionId",
    "columnName": "belongRegionId",
    "fieldId": "belongRegionId",
    "fieldName": "belongRegionId",
    "values": [
        {
            "id": "15{0471#0472#0474#0477#0442#0473#0476#0475#0479#0482#0483#0470}@010@022@37{0531#0533#0543#0631#0539#0633#0536#0546#0632#0537#0530#0634#0535#0532#0538#0534#0635}@13{0311#0317#0315#0335#0316#0313#0319#0310#0312#0314#0318}@14{0351#0354#0353#0352#0356#0355#0359#0357#0350#0349#0358}@00853@34{0551#0555#0552#0556#0553#0564#0558#0554#0562#0565#0563#0550#0557#0561#0559#0566#0567}@021@32{025#0510#0511#0518#0515#0527#0516#0517#0513#0514#0519#0523#0512}@33{0571#0572#0573#0580#0575#0579#0574#0570#0578#0577#0576}@35{0591#0597#0594#0593#0599#0598#0592#0596#0595}@46{0898}@44{020#0759#0660#0663#0753#0757#0768#0763#0758#0766#0755#0750#0760#0751#0754#0662#0668#0752#0769#0756#0762}@45{0771#0770#0773#0772#0774#0775#0776#0777#0778#0779}@63{0971#0972#0979#0974#0970}@42{027#0717#0716#0713#0714#0710#0712#0711#0715#0719#0722#0724#0728#0718}@43{0731#0734#0730#0737#0735#0736#0738#0739#0743#0744#0745#0746}@36{0791#0798#0796#0797#0790#0701#0792#0795#0793#0799#0794}@41{0371#0379#0391#0373#0374#0395#0372#0370#0375#0394#0396#0398#0393#0392#0376#0377#0397}@54{0891}@51{028#0835#0834#0812#0833#0830#0832#0831#0813#0818#0825#0817#0826#0816#0838#0839#0827#0836#0837}@50@61{029#0917#0911#0913#0912#0919#0914#0915#0916#0910}@52{0851#0856#0855#0852#0854#0853#0857#0859#0858}@53{0871#0692#0875#0876#0883#0886#0887#0691#0873#0872#0888#0878#0877#0874#0870#0879}@62{0931#0932#0933#0934#0935#0936#0937#0938#0930#0943}@64{0951#0953#0952#0954}@65{0991#0994#0992#0993#0995#0996#0997#0998#0999#0990#0902#0909#0901#0906#0908#0903}@22{0431#0432#0434#0438#0435#0437#0436#0439#0433}@21{024#0410#0412#0413#0414#0415#0416#0417#0418#0419#0421#0427#0429#0411}@001@999@23{0451#0452#0454#0459#0453#0455#0456#0467#0464#0468#0469#0457#0458}@-2",
            "name": "内蒙古{呼和浩特#包头#乌兰察布盟#伊克昭盟#巴延卓尔盟#乌海#赤峰#通辽（哲里木盟）#锡林浩特#兴安盟#阿盟#呼盟（海拉尔）}@北京@天津@山东{济南#淄博#滨州#威海#临沂#日照#潍纺#东营#枣庄#济宁#荷泽#莱芜#烟台#青岛#泰安#德州#聊城}@河北{石家庄#沧州#唐山#秦皇岛#廊坊#张家口#邢台#邯郸#保定#承德#衡水}@山西{太原#晋中#阳泉#大同#晋城#长治#运城#临汾#忻州#朔州#离石}@澳门@安徽{合肥#马鞍山#蚌埠#安庆#芜湖#六安#阜阳#淮南#铜陵#巢湖#宣城#滁州#宿州#淮北#黄山#池州#亳州}@上海@江苏{南京#无锡#镇江#连云港#盐城#宿迁#徐州#淮阴#南通#扬州#常州#泰州#苏州（含常熟）}@浙江{杭州#湖州#嘉兴#舟山#绍兴#金华#宁波#衢州#丽水#温州#台州}@福建{福州#龙岩#莆田#宁德#南平#三明#厦门#漳州#泉州}@海南{海口（含三亚，儋州）}@广东{广州#湛江#汕尾#揭阳#梅州#佛山#潮州#清远#肇庆#云浮#深圳#江门#中山#韶关#汕头#阳江#茂名#惠州#东莞#珠海#河源}@广西{南宁#防城港#桂林#柳州#梧州（含贺州）#玉林（含贵港）#百色#钦州#河池#北海}@青海{西宁#海东#海西洲（含格尔木）#海南洲#海北洲}@湖北{武汉#宜昌#荆州#黄冈#黄石#襄樊#孝感#鄂州#咸宁#十堰（含神农架）#随州#荆门#天门（含潜江，仙桃）#恩施}@湖南{长沙（含株州，湘潭，浏阳）#衡阳#岳阳#益阳#郴州#常德#娄底#邵阳#吉首#张家界#怀化#永州}@江西{南昌#景德镇#吉安#赣州#新余#鹰潭#九江#宜春#上饶#萍乡#抚州}@河南{郑州（含开封）#洛阳#焦作（含济源）#新乡#许昌#漯河#安阳#商丘#平顶山#周口#驻马店#三门峡#濮阳#鹤壁#信阳#南阳#潢川}@西藏{拉萨}@四川{成都（含眉山，资阳）#雅安#西昌#攀枝花#乐山#泸州#内江#宜宾#自贡#达川#遂宁#南充#广安#绵阳#德阳#广元#巴中#康定#马尔康}@重庆@陕西{西安#宝鸡#延安#渭南#榆林#铜川#商洛#安康#汉中#咸阳}@贵州{贵阳#铜仁#凯里#遵义#都匀#安顺#毕节#兴义#六盘水}@云南{昆明#德宏#保山#文山#临沧#怒江#迪庆#西双版纳#红河#大理#丽江#楚雄#玉溪#曲靖#昭通#思茅}@甘肃{兰州#定西#平凉#庆阳#武威#张掖#嘉峪关#天水#临夏#白银}@宁夏{银川#吴忠（银南）#石嘴山（银北）#固原}@新疆{乌鲁木齐#昌吉#奎屯#石河子#吐鲁番#库尔勒#阿克苏#喀什#伊犁#克拉玛依#哈密#博乐#塔城#阿勒泰#克州#和田}@吉林{长春#吉林#四平#松原#通化#辽源#白城#白山#延吉}@辽宁{沈阳#铁岭#鞍山#抚顺#本溪#丹东#锦州#营口#阜新#辽阳#朝阳#盘锦#葫芦岛#大连}@中国联通总部@异网@黑龙江{哈尔滨#齐齐哈尔#佳木斯#大庆#牡丹江#绥化#黑河#鸡西#七台河#鹤岗#双鸭山#大兴安岭#伊春}@未识别",
            "columnId": "15{0471#0472#0474#0477#0442#0473#0476#0475#0479#0482#0483#0470}@010@022@37{0531#0533#0543#0631#0539#0633#0536#0546#0632#0537#0530#0634#0535#0532#0538#0534#0635}@13{0311#0317#0315#0335#0316#0313#0319#0310#0312#0314#0318}@14{0351#0354#0353#0352#0356#0355#0359#0357#0350#0349#0358}@00853@34{0551#0555#0552#0556#0553#0564#0558#0554#0562#0565#0563#0550#0557#0561#0559#0566#0567}@021@32{025#0510#0511#0518#0515#0527#0516#0517#0513#0514#0519#0523#0512}@33{0571#0572#0573#0580#0575#0579#0574#0570#0578#0577#0576}@35{0591#0597#0594#0593#0599#0598#0592#0596#0595}@46{0898}@44{020#0759#0660#0663#0753#0757#0768#0763#0758#0766#0755#0750#0760#0751#0754#0662#0668#0752#0769#0756#0762}@45{0771#0770#0773#0772#0774#0775#0776#0777#0778#0779}@63{0971#0972#0979#0974#0970}@42{027#0717#0716#0713#0714#0710#0712#0711#0715#0719#0722#0724#0728#0718}@43{0731#0734#0730#0737#0735#0736#0738#0739#0743#0744#0745#0746}@36{0791#0798#0796#0797#0790#0701#0792#0795#0793#0799#0794}@41{0371#0379#0391#0373#0374#0395#0372#0370#0375#0394#0396#0398#0393#0392#0376#0377#0397}@54{0891}@51{028#0835#0834#0812#0833#0830#0832#0831#0813#0818#0825#0817#0826#0816#0838#0839#0827#0836#0837}@50@61{029#0917#0911#0913#0912#0919#0914#0915#0916#0910}@52{0851#0856#0855#0852#0854#0853#0857#0859#0858}@53{0871#0692#0875#0876#0883#0886#0887#0691#0873#0872#0888#0878#0877#0874#0870#0879}@62{0931#0932#0933#0934#0935#0936#0937#0938#0930#0943}@64{0951#0953#0952#0954}@65{0991#0994#0992#0993#0995#0996#0997#0998#0999#0990#0902#0909#0901#0906#0908#0903}@22{0431#0432#0434#0438#0435#0437#0436#0439#0433}@21{024#0410#0412#0413#0414#0415#0416#0417#0418#0419#0421#0427#0429#0411}@001@999@23{0451#0452#0454#0459#0453#0455#0456#0467#0464#0468#0469#0457#0458}@-2",
            "columnName": "内蒙古{呼和浩特#包头#乌兰察布盟#伊克昭盟#巴延卓尔盟#乌海#赤峰#通辽（哲里木盟）#锡林浩特#兴安盟#阿盟#呼盟（海拉尔）}@北京@天津@山东{济南#淄博#滨州#威海#临沂#日照#潍纺#东营#枣庄#济宁#荷泽#莱芜#烟台#青岛#泰安#德州#聊城}@河北{石家庄#沧州#唐山#秦皇岛#廊坊#张家口#邢台#邯郸#保定#承德#衡水}@山西{太原#晋中#阳泉#大同#晋城#长治#运城#临汾#忻州#朔州#离石}@澳门@安徽{合肥#马鞍山#蚌埠#安庆#芜湖#六安#阜阳#淮南#铜陵#巢湖#宣城#滁州#宿州#淮北#黄山#池州#亳州}@上海@江苏{南京#无锡#镇江#连云港#盐城#宿迁#徐州#淮阴#南通#扬州#常州#泰州#苏州（含常熟）}@浙江{杭州#湖州#嘉兴#舟山#绍兴#金华#宁波#衢州#丽水#温州#台州}@福建{福州#龙岩#莆田#宁德#南平#三明#厦门#漳州#泉州}@海南{海口（含三亚，儋州）}@广东{广州#湛江#汕尾#揭阳#梅州#佛山#潮州#清远#肇庆#云浮#深圳#江门#中山#韶关#汕头#阳江#茂名#惠州#东莞#珠海#河源}@广西{南宁#防城港#桂林#柳州#梧州（含贺州）#玉林（含贵港）#百色#钦州#河池#北海}@青海{西宁#海东#海西洲（含格尔木）#海南洲#海北洲}@湖北{武汉#宜昌#荆州#黄冈#黄石#襄樊#孝感#鄂州#咸宁#十堰（含神农架）#随州#荆门#天门（含潜江，仙桃）#恩施}@湖南{长沙（含株州，湘潭，浏阳）#衡阳#岳阳#益阳#郴州#常德#娄底#邵阳#吉首#张家界#怀化#永州}@江西{南昌#景德镇#吉安#赣州#新余#鹰潭#九江#宜春#上饶#萍乡#抚州}@河南{郑州（含开封）#洛阳#焦作（含济源）#新乡#许昌#漯河#安阳#商丘#平顶山#周口#驻马店#三门峡#濮阳#鹤壁#信阳#南阳#潢川}@西藏{拉萨}@四川{成都（含眉山，资阳）#雅安#西昌#攀枝花#乐山#泸州#内江#宜宾#自贡#达川#遂宁#南充#广安#绵阳#德阳#广元#巴中#康定#马尔康}@重庆@陕西{西安#宝鸡#延安#渭南#榆林#铜川#商洛#安康#汉中#咸阳}@贵州{贵阳#铜仁#凯里#遵义#都匀#安顺#毕节#兴义#六盘水}@云南{昆明#德宏#保山#文山#临沧#怒江#迪庆#西双版纳#红河#大理#丽江#楚雄#玉溪#曲靖#昭通#思茅}@甘肃{兰州#定西#平凉#庆阳#武威#张掖#嘉峪关#天水#临夏#白银}@宁夏{银川#吴忠（银南）#石嘴山（银北）#固原}@新疆{乌鲁木齐#昌吉#奎屯#石河子#吐鲁番#库尔勒#阿克苏#喀什#伊犁#克拉玛依#哈密#博乐#塔城#阿勒泰#克州#和田}@吉林{长春#吉林#四平#松原#通化#辽源#白城#白山#延吉}@辽宁{沈阳#铁岭#鞍山#抚顺#本溪#丹东#锦州#营口#阜新#辽阳#朝阳#盘锦#葫芦岛#大连}@中国联通总部@异网@黑龙江{哈尔滨#齐齐哈尔#佳木斯#大庆#牡丹江#绥化#黑河#鸡西#七台河#鹤岗#双鸭山#大兴安岭#伊春}@未识别",
            "fieldId": "",
            "fieldName": "",
            "values": []
        }
    ],
    "canDirll": true,
    "checked": false,
    "displayType": 3
}'''
import json
mjson=json.loads(str1)
mid=mjson['values'][0]['id']
def produce(idx):
    value={}
    value['id']=idx
    value['name']=''
    value['columnId']=idx
    value['columnName']=''
    return value
values=[]
for idm in mid.split('@'):
    if idm.find('{') >0 and idm.find('}') >0:
        cs=idm.index('{')
        es=idm.index('}')
        v=produce(idm[0:cs])
        v['values']=[]
        vs=idm[(cs+1):es]
        for mid in vs.split('#'):
            v1=produce(mid)
            v['values'].append(v1)
        values.append(v)
    else:
        v=produce(idm)
        values.append(v)
mjson['values']=values
print json.dumps(mjson)
